%各方面速度测试

%1.空循环测试
a=0.6;
b=pi^2*1000;

tic;
for n=1:1
end
t=toc

%10000次循环4e-5
%1-100次循环4e-6

%启动循环3.266e-8
%循环中每次3.6382e-9

%double加减乘除每次1e-9,int也一样....所以这个是最不怕用的多的....
%max(两个数)6.1165e-9
%max([数组])1.3771e-6 (相当于300次乘法...);
%三角函数5.6722e-8
%反三角函数1.6491e-6用的多的话就1/4倍时间;
%指数2.76e-8
%赋值每次3.9103e-9;
%调用自编函数每次3.159e-7;相当于300次乘法
%文件内调用函数3.099e-7;同样时间
%if end 几乎不用时间
%同变量赋值,几乎不用时间;
%cross([],[])叉乘 5.22e-5非常坑爹
%[a b c];4.68e-007相当于400次乘法
%sqrt根号运算在3.5e-8左右,相当于35次乘法
%数组的单下标赋值在2e-9
%单下标读取1e-9

